Revit 2027 API
DisplacementPath.IsValidParam Method
 Is the specified value a valid edge or curve parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidParam(
	double param
)
Public Shared Function IsValidParam (
	param As Double
) As Boolean
public:
static bool IsValidParam(
	double param
)
static member IsValidParam :
        param : float -> bool
Parameters
param Double
 proposed edge parameter.
Return Value
Boolean
See Also
Reference
DisplacementPath Class
Autodesk.Revit.DB Namespace